## Production: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| recreate | `aws_cloudwatch_metric_alarm.api_error`           |
|          | `aws_cloudwatch_metric_alarm.api_secret_detected` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.api_error must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "api_error" {
      ~ alarm_description                     = "Errors logged by the API lambda function" -> "Error logged by the API lambda function."
      ~ alarm_name                            = "ErrorLoggedAPI" -> "GitHub secret scanning: error" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:283582579564:alarm:ErrorLoggedAPI" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "ErrorLoggedAPI" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.api_secret_detected must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "api_secret_detected" {
      ~ alarm_description                     = "GitHub alert that a secret has been detected" -> "GitHub alert that a secret has been found in a repo."
      ~ alarm_name                            = "SecretDetectedAPI" -> "GitHub secret scanning: secret detected" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:283582579564:alarm:SecretDetectedAPI" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "SecretDetectedAPI" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api_secret_detected"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudwatch_alarms_slack.aws_lambda_function.notify_slack"]

23 tests, 16 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
